I also seeing this error in my environment using provider 5.86.1. 

For some reason it's ignoring my "and" block and setting more than one argument in the "filter" block.

- terraform configuration

```hcl
resource "aws_s3_bucket_lifecycle_configuration" "test" {
  bucket = aws_s3_bucket.test.bucket

  transition_default_minimum_object_size = "varies_by_storage_class"
  
  rule {
    status = Enabled

    id = "lifecycle-test"

    expiration {
      days = 7
    }

    filter {
      and {
        prefix = ""
        object_size_greater_than = 131072
      }
    }

    noncurrent_version_expiration {
      noncurrent_days = 1
    }
  }
}
```

- terraform plan output

```hcl
~ resource "aws_s3_bucket_lifecycle_configuration" "test" {
    id = "test"
    # (2 unchanged attributes hidden)
    ~ rule {
        id = "lifecycle-test"
        # (1 unchanged attribute hidden)
        ~ filter {
            + object_size_less_than = (known after apply)
            + prefix = (known after apply)
              # (1 unchanged attribute hidden)
            + and {
                + object_size_greater_than = 131072
                + object_size_less_than = (known after apply)
            }
        }

        ~ noncurrent_version_expiration {
            + newer_noncurreent_versions = (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (1 unchanged block hidden)
    }
}
```

- Cloudtrail PutBucketLifecycle Event 

```json
{
    ...
    "requestParameters": {
        "lifecycle": "",
        "bucketName": "test",
        "LifecycleConfiguration": {
            "xmlns": "http://s3.amazonaws.com/doc/2006-03-01/",
            "Rule": [
                {
                    "Status": "Enabled",
                    "Filter": {
                        "ObjectSizeGreaterThan": 131072,
                        "Prefix": ""
                    },
                    "NoncurrentVersionExpiration": {
                        "NoncurrentDays": 1
                    },
                    "ID": "lifecycle-test"
                }
            ]
        }
    },
    ...
}
```